In [12]:
import pandas as pd

fish: Unknown command: pip
fish:
pip install openpyxl
^~^

In [13]:
df = pd.DataFrame(
    {
        'Name':['Amaan','Adnan','Riyan'],
        'Age':[25,25,220],
        'Gender':['Male', 'Male', 'Male']
    }
)

df

    Name  Age Gender
0  Amaan   25   Male
1  Adnan   25   Male
2  Riyan  220   Male

In [11]:
df.to_excel('test.xlsx')

In [14]:
df[0:1]

    Name  Age Gender
0  Amaan   25   Male

In [15]:
df['Name']

0    Amaan
1    Adnan
2    Riyan
Name: Name, dtype: object

In [18]:
df[['Name', 'Gender']]

    Name Gender
0  Amaan   Male
1  Adnan   Male
2  Riyan   Male

**WAP to Create a DataFrame of your Choice and then display first row, first colm first 2 rows and first 2 colum with df.loc**
1. emp_ID
2. Emp_Role
3. Salary

In [36]:
df = pd.DataFrame({
    'Emp_ID':[101,102,103],
    'Emp_Role':['Data Sciantist', 'DevOPs Engineer', 'Bussiness Analytist'],
    'Salary':[19000, 15000, 10000]
})


df

   Emp_ID             Emp_Role  Salary
0     101       Data Sciantist   19000
1     102      DevOPs Engineer   15000
2     103  Bussiness Analytist   10000

In [39]:
df.loc

In [40]:
df.loc[:, 'Emp_Role'] # Selecting all rows (:) for the column 'Emp_Role'

0         Data Sciantist
1        DevOPs Engineer
2    Bussiness Analytist
Name: Emp_Role, dtype: object

In [41]:
df.loc[0:1]  # Selecting rows from index 0 to 1 (inclusive)

   Emp_ID         Emp_Role  Salary
0     101   Data Sciantist   19000
1     102  DevOPs Engineer   15000

In [42]:
df.loc[:, 'Emp_Role':'Salary'] # Selecting all rows (:) for columns from 'Emp_Role' to 'Salary' (inclusive)

              Emp_Role  Salary
0       Data Sciantist   19000
1      DevOPs Engineer   15000
2  Bussiness Analytist   10000

In [45]:
data = {
    'Name': ['Alice', 'Bob', 'Uwaish', 'Sayeeda', 'Asim'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['Delhi', 'Mumbai', 'Chennai', 'Kolkata', 'Bangalore'],
    'Score': [85, 90, 95, 80, 75]
}

df = pd.DataFrame(data)

In [46]:
df.iloc[::2]

     Name  Age       City  Score
0   Alice   25      Delhi     85
2  Uwaish   35    Chennai     95
4    Asim   45  Bangalore     75

In [47]:
df.iloc[1:4, [1, 3]]

   Age  Score
1   30     90
2   35     95
3   40     80

In [48]:
df.iloc[-1, 1] = df.iloc[-1, 1] + 5

df

      Name  Age       City  Score
0    Alice   25      Delhi     85
1      Bob   30     Mumbai     90
2   Uwaish   35    Chennai     95
3  Sayeeda   40    Kolkata     80
4     Asim   50  Bangalore     75

In [49]:
first_score = df.iloc[0, 3]
last_score = df.iloc[-1, 3]

df.iloc[0, 3] = last_score
df.iloc[-1, 3] = first_score

df

      Name  Age       City  Score
0    Alice   25      Delhi     75
1      Bob   30     Mumbai     90
2   Uwaish   35    Chennai     95
3  Sayeeda   40    Kolkata     80
4     Asim   50  Bangalore     85